; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p9---int100n150-m25---int100c150---s125---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level8 level8)
(sum level0 level13 level13)
(sum level0 level17 level17)
(sum level1 level5 level6)
(sum level1 level8 level9)
(sum level1 level13 level14)
(sum level1 level17 level18)
(sum level2 level5 level7)
(sum level2 level8 level10)
(sum level2 level13 level15)
(sum level2 level17 level19)
(sum level3 level5 level8)
(sum level3 level8 level11)
(sum level3 level13 level16)
(sum level3 level17 level20)
(sum level4 level5 level9)
(sum level4 level8 level12)
(sum level4 level13 level17)
(sum level4 level17 level21)
(sum level5 level5 level10)
(sum level5 level8 level13)
(sum level5 level13 level18)
(sum level5 level17 level22)
(sum level6 level5 level11)
(sum level6 level8 level14)
(sum level6 level13 level19)
(sum level6 level17 level23)
(sum level7 level5 level12)
(sum level7 level8 level15)
(sum level7 level13 level20)
(sum level7 level17 level24)
(sum level8 level5 level13)
(sum level8 level8 level16)
(sum level8 level13 level21)
(sum level8 level17 level25)
(sum level9 level5 level14)
(sum level9 level8 level17)
(sum level9 level13 level22)
(sum level9 level17 level26)
(sum level10 level5 level15)
(sum level10 level8 level18)
(sum level10 level13 level23)
(sum level10 level17 level27)
(sum level11 level5 level16)
(sum level11 level8 level19)
(sum level11 level13 level24)
(sum level11 level17 level28)
(sum level12 level5 level17)
(sum level12 level8 level20)
(sum level12 level13 level25)
(sum level12 level17 level29)
(sum level13 level5 level18)
(sum level13 level8 level21)
(sum level13 level13 level26)
(sum level13 level17 level30)
(sum level14 level5 level19)
(sum level14 level8 level22)
(sum level14 level13 level27)
(sum level14 level17 level31)
(sum level15 level5 level20)
(sum level15 level8 level23)
(sum level15 level13 level28)
(sum level15 level17 level32)
(sum level16 level5 level21)
(sum level16 level8 level24)
(sum level16 level13 level29)
(sum level16 level17 level33)
(sum level17 level5 level22)
(sum level17 level8 level25)
(sum level17 level13 level30)
(sum level17 level17 level34)
(sum level18 level5 level23)
(sum level18 level8 level26)
(sum level18 level13 level31)
(sum level18 level17 level35)
(sum level19 level5 level24)
(sum level19 level8 level27)
(sum level19 level13 level32)
(sum level19 level17 level36)
(sum level20 level5 level25)
(sum level20 level8 level28)
(sum level20 level13 level33)
(sum level20 level17 level37)
(sum level21 level5 level26)
(sum level21 level8 level29)
(sum level21 level13 level34)
(sum level21 level17 level38)
(sum level22 level5 level27)
(sum level22 level8 level30)
(sum level22 level13 level35)
(sum level22 level17 level39)
(sum level23 level5 level28)
(sum level23 level8 level31)
(sum level23 level13 level36)
(sum level23 level17 level40)
(sum level24 level5 level29)
(sum level24 level8 level32)
(sum level24 level13 level37)
(sum level24 level17 level41)
(sum level25 level5 level30)
(sum level25 level8 level33)
(sum level25 level13 level38)
(sum level25 level17 level42)
(sum level26 level5 level31)
(sum level26 level8 level34)
(sum level26 level13 level39)
(sum level26 level17 level43)
(sum level27 level5 level32)
(sum level27 level8 level35)
(sum level27 level13 level40)
(sum level27 level17 level44)
(sum level28 level5 level33)
(sum level28 level8 level36)
(sum level28 level13 level41)
(sum level28 level17 level45)
(sum level29 level5 level34)
(sum level29 level8 level37)
(sum level29 level13 level42)
(sum level29 level17 level46)
(sum level30 level5 level35)
(sum level30 level8 level38)
(sum level30 level13 level43)
(sum level30 level17 level47)
(sum level31 level5 level36)
(sum level31 level8 level39)
(sum level31 level13 level44)
(sum level31 level17 level48)
(sum level32 level5 level37)
(sum level32 level8 level40)
(sum level32 level13 level45)
(sum level32 level17 level49)
(sum level33 level5 level38)
(sum level33 level8 level41)
(sum level33 level13 level46)
(sum level33 level17 level50)
(sum level34 level5 level39)
(sum level34 level8 level42)
(sum level34 level13 level47)
(sum level34 level17 level51)
(sum level35 level5 level40)
(sum level35 level8 level43)
(sum level35 level13 level48)
(sum level35 level17 level52)
(sum level36 level5 level41)
(sum level36 level8 level44)
(sum level36 level13 level49)
(sum level36 level17 level53)
(sum level37 level5 level42)
(sum level37 level8 level45)
(sum level37 level13 level50)
(sum level37 level17 level54)
(sum level38 level5 level43)
(sum level38 level8 level46)
(sum level38 level13 level51)
(sum level38 level17 level55)
(sum level39 level5 level44)
(sum level39 level8 level47)
(sum level39 level13 level52)
(sum level39 level17 level56)
(sum level40 level5 level45)
(sum level40 level8 level48)
(sum level40 level13 level53)
(sum level40 level17 level57)
(sum level41 level5 level46)
(sum level41 level8 level49)
(sum level41 level13 level54)
(sum level41 level17 level58)
(sum level42 level5 level47)
(sum level42 level8 level50)
(sum level42 level13 level55)
(sum level42 level17 level59)
(sum level43 level5 level48)
(sum level43 level8 level51)
(sum level43 level13 level56)
(sum level43 level17 level60)
(sum level44 level5 level49)
(sum level44 level8 level52)
(sum level44 level13 level57)
(sum level44 level17 level61)
(sum level45 level5 level50)
(sum level45 level8 level53)
(sum level45 level13 level58)
(sum level45 level17 level62)
(sum level46 level5 level51)
(sum level46 level8 level54)
(sum level46 level13 level59)
(sum level46 level17 level63)
(sum level47 level5 level52)
(sum level47 level8 level55)
(sum level47 level13 level60)
(sum level47 level17 level64)
(sum level48 level5 level53)
(sum level48 level8 level56)
(sum level48 level13 level61)
(sum level48 level17 level65)
(sum level49 level5 level54)
(sum level49 level8 level57)
(sum level49 level13 level62)
(sum level49 level17 level66)
(sum level50 level5 level55)
(sum level50 level8 level58)
(sum level50 level13 level63)
(sum level50 level17 level67)
(sum level51 level5 level56)
(sum level51 level8 level59)
(sum level51 level13 level64)
(sum level51 level17 level68)
(sum level52 level5 level57)
(sum level52 level8 level60)
(sum level52 level13 level65)
(sum level52 level17 level69)
(sum level53 level5 level58)
(sum level53 level8 level61)
(sum level53 level13 level66)
(sum level53 level17 level70)
(sum level54 level5 level59)
(sum level54 level8 level62)
(sum level54 level13 level67)
(sum level54 level17 level71)
(sum level55 level5 level60)
(sum level55 level8 level63)
(sum level55 level13 level68)
(sum level55 level17 level72)
(sum level56 level5 level61)
(sum level56 level8 level64)
(sum level56 level13 level69)
(sum level56 level17 level73)
(sum level57 level5 level62)
(sum level57 level8 level65)
(sum level57 level13 level70)
(sum level57 level17 level74)
(sum level58 level5 level63)
(sum level58 level8 level66)
(sum level58 level13 level71)
(sum level58 level17 level75)
(sum level59 level5 level64)
(sum level59 level8 level67)
(sum level59 level13 level72)
(sum level59 level17 level76)
(sum level60 level5 level65)
(sum level60 level8 level68)
(sum level60 level13 level73)
(sum level60 level17 level77)
(sum level61 level5 level66)
(sum level61 level8 level69)
(sum level61 level13 level74)
(sum level61 level17 level78)
(sum level62 level5 level67)
(sum level62 level8 level70)
(sum level62 level13 level75)
(sum level63 level5 level68)
(sum level63 level8 level71)
(sum level63 level13 level76)
(sum level64 level5 level69)
(sum level64 level8 level72)
(sum level64 level13 level77)
(sum level65 level5 level70)
(sum level65 level8 level73)
(sum level65 level13 level78)
(sum level66 level5 level71)
(sum level66 level8 level74)
(sum level67 level5 level72)
(sum level67 level8 level75)
(sum level68 level5 level73)
(sum level68 level8 level76)
(sum level69 level5 level74)
(sum level69 level8 level77)
(sum level70 level5 level75)
(sum level70 level8 level78)
(sum level71 level5 level76)
(sum level72 level5 level77)
(sum level73 level5 level78)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l2)
(fuelcost level13 l0 l2)
(connected l0 l3)
(fuelcost level13 l0 l3)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l2)
(fuelcost level17 l1 l2)
(connected l1 l3)
(fuelcost level8 l1 l3)
(connected l2 l0)
(fuelcost level13 l2 l0)
(connected l2 l1)
(fuelcost level17 l2 l1)
(connected l2 l3)
(fuelcost level13 l2 l3)
(connected l3 l0)
(fuelcost level13 l3 l0)
(connected l3 l1)
(fuelcost level8 l3 l1)
(connected l3 l2)
(fuelcost level13 l3 l2)

(at t0 l2)
(fuel t0 level78)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l0)
(at p3 l0)
(at p4 l1)
(at p5 l3)
(at p6 l1)
(at p7 l1)
(at p8 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l3)
(at p2 l1)
(at p3 l2)
(at p4 l3)
(at p5 l1)
(at p6 l2)
(at p7 l2)
(at p8 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l2 l3 level65 level13 level78)
   deleted: (at t0 l2) (fuel t0 level78)
   added: (at t0 l3) (fuel t0 level65)
   goals met: 0 of 9
2. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 9
3. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 9
4. (drive t0 l3 l0 level52 level13 level65)
   deleted: (at t0 l3) (fuel t0 level65)
   added: (at t0 l0) (fuel t0 level52)
   goals met: 0 of 9
5. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 9
6. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 9
7. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 1 of 9
8. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 9
9. (drive t0 l0 l1 level47 level5 level52)
   deleted: (at t0 l0) (fuel t0 level52)
   added: (at t0 l1) (fuel t0 level47)
   goals met: 1 of 9
10. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 1 of 9
11. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 1 of 9
12. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 1 of 9
13. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 1 of 9
14. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 2 of 9
15. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 3 of 9
16. (drive t0 l1 l2 level30 level17 level47)
   deleted: (at t0 l1) (fuel t0 level47)
   added: (at t0 l2) (fuel t0 level30)
   goals met: 3 of 9
17. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 4 of 9
18. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 5 of 9
19. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 6 of 9
20. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 7 of 9
21. (drive t0 l2 l3 level17 level13 level30)
   deleted: (at t0 l2) (fuel t0 level30)
   added: (at t0 l3) (fuel t0 level17)
   goals met: 7 of 9
22. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 8 of 9
23. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 9 of 9
